def solve_puzzles():
    """تابعی برای چک کردن و پیدا کردن مقادیرtrue or false 
    و سپس برگرداندن ان ها"""
        
        
    #تمام مقادیر رو تبدیل به یه لیست کردم که به عنوان ورودی تابع باشه ولی چون در نهایت باید خروجی همه ی توابع رو داشته باشیم اوردمش توی خود تابع که با متغیر های دیگه قاطی نشه
    puzzle = ['ali',
        '1233',
        0,
        "",
        [],
        {},
        'False',
        '0',
        'None',
        None,
        -1,
        [1, 2, 3],
        {'key': 'value'},
        True,
        ' ',
        '[]',
        '[1, 2, 3]',
        '{}',
        "{'a': 1}",
        True,
        'ali',
        '1234',
        1,
        0.1,
        -0.1,
        True,
        ' ',
        '[]',
        '[1, 2, 3]',
        '{}',
        "{'a': 1}",
        True,
        'ali',
        '1234',
        1,
        0.1,
        -0.1]
    
    x = []#یه لیست خالی درست کردم که بتونم بعدا ورودی هایی که ویژگی مورد نظر رو داشتن توی لیست اضافه و چاپ کنم
    for i in puzzle:
        i = bool(i)
        x.append(i)
    return x
        


print(solve_puzzles())
